/*
 * i2c.h
 *
 * Created: 19.12.2018 10:34:09
 *  Author: GunMan
 */ 


#ifndef I2C_H_
#define I2C_H_

#define I2C_PORT PORTC
#define I2C_DDR  DDRC
#define I2C_PIN  PINC
#define I2C_WP	 0
#define I2C_SCL  5
#define I2C_SDA  4

#define SCL_UP() (I2C_DDR &= ~(1<<I2C_SCL))
#define SCL_DOWN() (I2C_DDR |= (1<<I2C_SCL))
#define SDA_UP() (I2C_DDR &= ~(1<<I2C_SDA))
#define SDA_DOWN() (I2C_DDR |= (1<<I2C_SDA))
#define IS_ACK() ((~I2C_PIN) & (1<<I2C_SDA))
#define WP_ON() (I2C_DDR &= ~(1<<I2C_WP))
#define WP_OFF() (I2C_DDR |= (1<<I2C_WP))
#define CONTROL 0xA0

/*************************************************************************	
  Посылает стартовый импульс и занимает шину.
*************************************************************************/
void i2c_start(void);


/*************************************************************************
  Завершает обменн данными о освобождает шину.
*************************************************************************/
void i2c_stop(void);


/*************************************************************************
 Посылает один байт и возвращает ACK.
*************************************************************************/
uint8_t i2c_transmit(uint8_t byte);


/*************************************************************************
 Читает один байт в переменную переданную по ссылке и посылает ACK.
*************************************************************************/
void i2c_receive( uint8_t* byte, uint8_t ack);


/*************************************************************************
  Переводит регистр адреса ПЗУ на заданный адрес 24c64
*************************************************************************/
uint8_t i2c_set_address_c64(uint16_t address, uint8_t for_read);


/*************************************************************************
  Записывает 4 байта по заданному адресу 24c64 и возвращает error
*************************************************************************/
uint8_t i2c_write_c64( uint16_t address, uint8_t* data );


/*************************************************************************
  Читает 4 байта по заданному адресу 24c64 и возвращает error
*************************************************************************/
uint8_t i2c_read_c64( uint16_t address, uint8_t* data );

#endif /* I2C_H_ */